// BubbleSorting Example
// ბუშტულას სორტირება

const arr = [1,451,2,51, 52, 21, 13];


function bbsort(arr){
    let i,j;
    // პირველი ფორ ლუპი შეასრულებს იმდენ მოქმედებას რამხელა სიგრისაც იქნება მასივი
    for(i = 0; i < arr.length-1;i++){
        // მეორე ლუპის სიგრძე ყოველი იტერაციისას მცირდება ერთით. მისი მიზანია, 
        // რომ უკვე დალაგებულ მასივის ნაწილს აღარ შეეხოს ცვლილება.
        for(j = 0;j< arr.length-i-1;j++){

            // ყოველი იტერაციისას იფ ამოწმებს ელემენტებს თუ მარცხენა ელემენტი მეტი იქნება მარჯვენაზე
            // ისინი ერთმანეთს გაუცვლიან ადგილს. ასე ყველაზე მაღალი ელემენტი გადაინაცვლებს მასივის უკიდურეს 
            // მარჯვენა ნაწილში (ყოველი იტერაციისას უკიდურესი მარჯვენა ნაწილი მცირდება ერთით)
            if(arr[j] > arr[j+1]){
                let temp = arr[j];
                arr[j] = arr[j + 1];
                arr[j + 1] = temp;
            }
        }
    }
    
    return arr;
}

// კონსოლში გამოგვაქვს ფუნცქიის მიერ დაბრუნებული დალაგებული მასივი
console.log(bbsort(arr));
